tap "nikitabobko/tap", trusted: true
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Dependency manager for Cocoa projects
brew "cocoapods"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Tools for building Android applications
cask "android-studio"
# Agent orchestration platform
cask "antigravity"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Configuration manager for AI coding agents
cask "cc-switch"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
mas "DaVinci Resolve", id: 571213070
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "swmansion.react-native-ide"
vscode "usernamehw.errorlens"
vscode "vizards.deepseek-v4-for-copilot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-upgrade"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
